tutorials/heatTransfer/heatSimpleFoam/ImpJet-Dflt/0/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class volScalarField;
 format ascii;
 object k;
 version 2.0;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 1;

boundaryField
{
  Ambient
  {
    type zeroGradient;
  }
  Entrainment
  {
    type zeroGradient;
  }
  ImpingedWall
  {
    type fixedValue;
    value uniform 1e-12;
  }
  oldInternalFaces
  {
    type zeroGradient;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type fixedValue;
    value uniform 1e-12;
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type mapped;
    setAverage no;
    average 1;
    value uniform 1;
    interpolationScheme cell;
  }
}

