tutorials/heatTransfer/heatSimpleFoam/ImpJet-Dflt/system/fvOptions
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object fvOptions;
 version 2.0;
}

DrivingForce1
{
  active yes;
  cellSet pipeCells;
  duration 1000000000.0;
  selectionMode cellSet;
  timeStart -1;
  type vectorSemiImplicitSource;
  vectorSemiImplicitSourceCoeffs
  {
    injectionRateSuSp
    {
      U
        (
          (0 0 -1)
          0
        );
    }
    volumeMode specific;
  }
}

HeatSource1
{
  active on;
  cellSet pipeCells;
  duration 1000000000.0;
  scalarSemiImplicitSourceCoeffs
  {
    injectionRateSuSp
    {
      T
        (
          1
          0
        );
    }
    volumeMode specific;
  }
  selectionMode cellSet;
  timeStart -1;
  type scalarSemiImplicitSource;
}

